# The isnull() function in pandas looks for the following values to replace in a DataFrame or Series:
# 1.) NaN (Not a Number): Represents missing or undefined numerical values.
# 2.) None: Represents missing or undefined non-numeric (object) values.
# 3.) NaT (Not a Time): Represents missing or undefined datetime values.Â¶

In [9]:
import pandas as pd
import numpy as np

# Sample data with different types of null values
data = {'Name': ['Alice', 'Bob', 'David', 'Eve', 'Frank',None],
        'Age': [25, 30, '', 40, 35, np.nan],
        'Score': [85, np.nan, 70, 92, None, 78],
        'Timestamp': ['2022-01-01', '2022-01-02', pd.NaT, '2022-01-04', '2022-01-05', '2022-01-06']}

df = pd.DataFrame(data)
df

    Name  Age  Score   Timestamp
0  Alice   25   85.0  2022-01-01
1    Bob   30    NaN  2022-01-02
2  David        70.0         NaT
3    Eve   40   92.0  2022-01-04
4  Frank   35    NaN  2022-01-05
5   None  NaN   78.0  2022-01-06

In [10]:
df[df['Name'].isnull()]

   Name  Age  Score   Timestamp
5  None  NaN   78.0  2022-01-06

In [29]:
df['Age'] = pd.to_numeric(df['Age'])

In [30]:
df['Timestamp']=pd.to_datetime(df['Timestamp'])

In [31]:
df

    Name   Age Score  Timestamp
0  Alice  25.0    85 2022-01-01
1    Bob  30.0   NaN 2022-01-02
2  David   NaN    70        NaT
3    Eve  40.0    92 2022-01-04
4  Frank  35.0  None 2022-01-05
5   None   NaN    78 2022-01-06
6          NaN              NaT

In [32]:
df[df['Name'].isnull()]

   Name  Age Score  Timestamp
5  None  NaN    78 2022-01-06

In [33]:
df[df['Score'].isnull()]

    Name   Age Score  Timestamp
1    Bob  30.0   NaN 2022-01-02
4  Frank  35.0  None 2022-01-05

In [34]:
df[df['Timestamp'].isnull()]

    Name  Age Score Timestamp
2  David  NaN    70       NaT
6         NaN             NaT

In [35]:
df[df.isnull().any(axis=1)] # finds null value in all columns

    Name   Age Score  Timestamp
1    Bob  30.0   NaN 2022-01-02
2  David   NaN    70        NaT
4  Frank  35.0  None 2022-01-05
5   None   NaN    78 2022-01-06
6          NaN              NaT